theorem h₇₉₁ (N : ℕ) (hN : N = ∑ i ∈ Finset.range 1998, 10 ^ i) (h₁ : N = (10 ^ 1998 - 1) / 9) (h₂ : 10 ^ 1998 > 1) (h₃ : 10 ^ 1999 > 7) (h₄ : 10 ^ 1998 - 1 > 0) (h₅ : ↑N = (10 ^ 1998 - 1) / 9) (h₆ : 10 ^ 1000 * √↑N < (10 ^ 1999 - 4) / 3) (h₇₁ : ↑N = (10 ^ 1998 - 1) / 9) (h₇₂ : √↑N = √((10 ^ 1998 - 1) / 9)) (h₇₄ : 0 < 10) (h₇₅ : 0 < 10 ^ 999) (h₇₆ : 0 < 10 ^ 1998 - 1) (h₇₇ : 0 < 10 ^ 1999 - 7) (h₇₈ : 0 < √((10 ^ 1998 - 1) / 9)) : √((10 ^ 1998 - 1) / 9) > 10 ^ 999 - 1 / (2 * 10 ^ 999) :=
  by
  have h₇₉₂ : 0 < (10 : ℝ) ^ 999 := by sorry
  have h₇₉₃ : 0 < (10 : ℝ) ^ 1998 - 1 := by sorry
  have h₇₉₄ : 0 < (2 * (10 : ℝ) ^ 999 : ℝ) := by sorry
  have h₇₉₅ : 0 < (10 : ℝ) ^ 999 * (2 * (10 : ℝ) ^ 999 : ℝ) := by sorry
  --  apply Real.lt_sqrt_of_sq_lt
  --  field_simp [h₇₉₂.ne', h₇₉₄.ne']
  --  rw [← sub_pos]
  --  field_simp [h₇₉₂.ne', h₇₉₄.ne']
  --  ring_nf
  --  --  norm_num <;> nlinarith [sq_nonneg ((10 : ℝ) ^ 998), sq_nonneg ((10 : ℝ) ^ 999)]
  hole