theorem h₂₁ (S : ℝ → ℕ → ℤ) (hS : S = fun x n => ⌊↑n * x⌋) (P : ℝ → Prop) (hP : ∀ (x : ℝ), P x ↔ x ^ 3 - 10 * x ^ 2 + 29 * x - 25 = 0) (h₁₁ : 2 ^ 3 - 10 * 2 ^ 2 + 29 * 2 - 25 = 1) (h₁₂ : 3 ^ 3 - 10 * 3 ^ 2 + 29 * 3 - 25 = -1) (h₁₃ : (5 / 2) ^ 3 - 10 * (5 / 2) ^ 2 + 29 * (5 / 2) - 25 = 5 / 8) (h₁₄ : 4 ^ 3 - 10 * 4 ^ 2 + 29 * 4 - 25 = 3) (h₁₅ : ContinuousOn (fun x => x ^ 3 - 10 * x ^ 2 + 29 * x - 25) (Icc 2 4)) (α : ℝ) (hα : α ∈ Ioo 2 3) (hα' : α ^ 3 - 10 * α ^ 2 + 29 * α - 25 = 0) (β : ℝ) (hβ : β ∈ Ioo 3 4) (hβ' : β ^ 3 - 10 * β ^ 2 + 29 * β - 25 = 0) : α ≠ β := by
  --  intro h
  have h₂₂ : α ∈ Set.Ioo 2 3 := hα
  have h₂₃ : β ∈ Set.Ioo 3 4 := hβ
  have h₂₄ : (α : ℝ) < 3 := h₂₂.2
  have h₂₅ : (β : ℝ) > 3 := h₂₃.1
  --  linarith
  hole