theorem h₁₀₆ (a b : ℕ → ℝ) (h₀ : ∀ (n : ℕ), a (n + 1) = √3 * a n - b n) (h₁ : ∀ (n : ℕ), b (n + 1) = √3 * b n + a n) (h₂ : a 100 = 2) (h₃ : b 100 = 4) (h₄ : ∀ (n : ℕ), a (n + 3) = -8 * b n) (h₅ : ∀ (n : ℕ), b (n + 3) = 8 * a n) (h₆ : ∀ (n : ℕ), a (n + 6) = -64 * a n) (h₇ : ∀ (n : ℕ), b (n + 6) = -64 * b n) (h₈ : a 4 = 1 / 2 ^ 95) (h₉ : b 4 = 1 / 2 ^ 94) (h₁₀₁ : a 4 = -8 * b 1) (h₁₀₄ : a 4 = 1 / 2 ^ 95) (h₁₀₅ : b 1 = -1 / 2 ^ 98) : b 4 = 8 * a 1 := by
  have h₁₀₆₁ := h₅ 1
  have h₁₀₆₂ := h₄ 1
  norm_num at h₁₀₆₁ h₁₀₆₂ ⊢ <;> linarith