theorem h₄ (x : NNReal) (h₀ : √(60 * (↑x : ℝ)) * √(12 * (↑x : ℝ)) * √(63 * (↑x : ℝ)) = √(60 * (↑x : ℝ) * (12 * (↑x : ℝ)) * (63 * (↑x : ℝ)))) (h₁ : √(60 * (↑x : ℝ) * (12 * (↑x : ℝ)) * (63 * (↑x : ℝ))) = √(45360 * (↑x : ℝ) ^ 3)) (h₂ : √(45360 * (↑x : ℝ) ^ 3) = √(36 ^ 2 * 35 * (↑x : ℝ) ^ 3)) (h₃ : √(36 ^ 2 * 35 * (↑x : ℝ) ^ 3) = 36 * √(35 * (↑x : ℝ) ^ 3)) : √(35 * (↑x : ℝ) ^ 3) = (↑x : ℝ) * √(35 * (↑x : ℝ)) :=
  by
  have h₄₁ : 0 ≤ (x : ℝ) := by sorry
  have h₄₂ : Real.sqrt (35 * (x : ℝ) ^ 3) = (x : ℝ) * Real.sqrt (35 * (x : ℝ)) := by sorry
  rw [h₄₂] <;> simp_all [Real.sqrt_eq_iff_sq_eq] <;> ring_nf <;> norm_num <;> linarith