theorem h₄₈ (x : NNReal) (h₀ : √(60 * (↑x : ℝ)) * √(12 * (↑x : ℝ)) * √(63 * (↑x : ℝ)) = √(60 * (↑x : ℝ) * (12 * (↑x : ℝ)) * (63 * (↑x : ℝ)))) (h₁ : √(60 * (↑x : ℝ) * (12 * (↑x : ℝ)) * (63 * (↑x : ℝ))) = √(45360 * (↑x : ℝ) ^ 3)) (h₂ : √(45360 * (↑x : ℝ) ^ 3) = √(36 ^ 2 * 35 * (↑x : ℝ) ^ 3)) (h₃ : √(36 ^ 2 * 35 * (↑x : ℝ) ^ 3) = 36 * √(35 * (↑x : ℝ) ^ 3)) (h₄₁ : 0 ≤ (↑x : ℝ)) (h₄₃ : √(35 * (↑x : ℝ) ^ 3) = √(35 * (↑x : ℝ) * (↑x : ℝ) ^ 2)) (h₄₅ : 0 ≤ (↑x : ℝ) ^ 2) (h₄₆ : 0 ≤ 35 * (↑x : ℝ)) (h₄₇ : 0 ≤ 35 * (↑x : ℝ) * (↑x : ℝ) ^ 2) : √(35 * (↑x : ℝ) * (↑x : ℝ) ^ 2) = (↑x : ℝ) * √(35 * (↑x : ℝ)) :=
  by
  rw [Real.sqrt_eq_iff_sq_eq (by positivity) (by positivity)]
  nlinarith [Real.sq_sqrt (by positivity : 0 ≤ (35 : ℝ) * (x : ℝ)), mul_self_nonneg (x : ℝ),
    mul_nonneg h₄₁ (sq_nonneg (x : ℝ))]