theorem h₇ (x : NNReal) (h₀ : √(60 * (↑x : ℝ)) * √(12 * (↑x : ℝ)) * √(63 * (↑x : ℝ)) = √(60 * (↑x : ℝ) * (12 * (↑x : ℝ)) * (63 * (↑x : ℝ)))) (h₁ : √(60 * (↑x : ℝ) * (12 * (↑x : ℝ)) * (63 * (↑x : ℝ))) = √(45360 * (↑x : ℝ) ^ 3)) (h₂ : √(45360 * (↑x : ℝ) ^ 3) = √(36 ^ 2 * 35 * (↑x : ℝ) ^ 3)) (h₃ : √(36 ^ 2 * 35 * (↑x : ℝ) ^ 3) = 36 * √(35 * (↑x : ℝ) ^ 3)) (h₄ : √(35 * (↑x : ℝ) ^ 3) = (↑x : ℝ) * √(35 * (↑x : ℝ))) (h₅ : 36 * √(35 * (↑x : ℝ) ^ 3) = 36 * (↑x : ℝ) * √(35 * (↑x : ℝ))) (h₆ : √(60 * (↑x : ℝ) * (12 * (↑x : ℝ)) * (63 * (↑x : ℝ))) = 36 * (↑x : ℝ) * √(35 * (↑x : ℝ))) : √(60 * (↑x : ℝ)) * √(12 * (↑x : ℝ)) * √(63 * (↑x : ℝ)) = 36 * (↑x : ℝ) * √(35 * (↑x : ℝ)) :=
  by
  have h₇₁ :
    Real.sqrt (60 * x) * Real.sqrt (12 * x) * Real.sqrt (63 * x) =
      Real.sqrt (60 * (x : ℝ) * (12 * (x : ℝ)) * (63 * (x : ℝ))) := by sorry
  rw [h₇₁]
  have h₇₂ : Real.sqrt (60 * (x : ℝ) * (12 * (x : ℝ)) * (63 * (x : ℝ))) = 36 * (x : ℝ) * Real.sqrt (35 * (x : ℝ)) := by sorry
  rw [h₇₂] <;> norm_cast <;> field_simp [Real.sqrt_eq_iff_sq_eq] <;> ring_nf <;> norm_num <;> nlinarith