theorem amc12b_2020_p2 :
    (100 ^ 2 - 7 ^ 2 : ℝ) / (70 ^ 2 - 11 ^ 2) * ((70 - 11) * (70 + 11) / ((100 - 7) * (100 + 7))) =
      1 := by
  have h1 : (100 : ℝ) ^ 2 - 7 ^ 2 = (100 - 7) * (100 + 7) := by
    admit
  
  have h2 : (70 : ℝ) ^ 2 - 11 ^ 2 = (70 - 11) * (70 + 11) := by
    admit
  
  have h3 : (100 ^ 2 - 7 ^ 2 : ℝ) / (70 ^ 2 - 11 ^ 2) * ((70 - 11) * (70 + 11) / ((100 - 7) * (100 + 7))) = 1 := by
    rw [h1, h2]
    have h4 : (70 - 11 : ℝ) ≠ 0 := by admit
    have h5 : (70 + 11 : ℝ) ≠ 0 := by admit
    have h6 : (100 - 7 : ℝ) ≠ 0 := by admit
    have h7 : (100 + 7 : ℝ) ≠ 0 := by admit
    admit
  
  admit