theorem h₇ (α : ℝ) (hα : Irrational α) (n : ℕ) (hn : 0 < n) (k : ℕ) (p : ℤ) (hk₀ : 0 < k) (hk₁ : k ≤ n) (hk₂ : |(↑k : ℝ) * α - (↑p : ℝ)| < 1 / ((↑n : ℝ) + 1)) (h₂ : (↑k : ℤ) > 0) (h₃ : (↑k : ℤ) ≤ (↑n : ℤ)) (h₄ : |(↑k : ℝ) * α - (↑p : ℝ)| < 1 / ((↑n : ℝ) + 1)) (h₅ : 0 < (↑k : ℝ)) (h₆ : (↑k : ℝ) ≤ (↑n : ℝ)) : |α - (↑p : ℝ) / (↑k : ℝ)| < 1 / (((↑n : ℝ) + 1) * (↑k : ℝ)) :=
  by
  have h₇₁ : |(k : ℝ) * α - p| < 1 / (n + 1 : ℝ) := hk₂
  have h₇₂ : |α - (p : ℝ) / k| = |(k : ℝ) * α - p| / k := by sorry
  --  rw [h₇₂]
  have h₇₃ : |(k : ℝ) * α - p| / k < 1 / ((n + 1 : ℝ) * k) := by sorry
  --  exact h₇₃
  linarith